{
  "American": "American cuisine consists of the cooking style and traditional dishes prepared in the United States. It has been significantly influenced by Europeans, indigenous Native Americans, Africans, Asians, Pacific Islanders, and many other cultures and traditions",
  "British": "Great Britain has a long and diverse culinary history shaped by various factors such as geography, climate, social and cultural influences, and trade relations with other countries. The early Britons subsisted on a diet of wild game, fish, and foraged fruits and vegetables, such as wine, olives, and exotic spices, which had a significant impact on local cuisine. During the medieval period, the cuisine of Great Britain was heavily influenced by the French, who brought with them a sophisticated culinary tradition.",
  "Canadian": "While the immense size of Canada, and the diversity of its inhabitants, compounds the difficulty in identifying a monolithic Canadian culinary tradition, Hersch Jacobs acknowledges that the lack of a hegemonic definition does not preclude the existence of Canadian cuisine.",
  "Chinese": "Chinese cuisine has a long history that can be traced back to the Zhou Dynasty (1046-256 BCE). The cuisine has been influenced by various factors, including regional differences, foreign invasions, and cultural exchanges with neighboring countries.",
  "Croatian": "Croatian cuisine is heterogeneous and is known as a cuisine of the regions, since every region of Croatia has its own distinct culinary tradition. Its roots date back to ancient times. The differences in the selection of foodstuffs and forms of cooking are most notable between those in mainland and those in coastal regions.",
  "Dutch": "Dutch cuisine is formed from the cooking traditions and practices of the Netherlands. The country's cuisine is shaped by its location in the fertile North Sea river delta of the European Plain, giving rise to fishing, farming (for crops, dairy and meat) and overseas trade. The Burgundian-Habsburg court enriched the cuisine of the Dutch elite in the 15th and 16th century, so did the colonial spice trade in the 17th century.",
  "Egyptian": "Egyptian cuisine relies heavily on vegetables and legumes, but can also feature meats, most commonly squab, chicken, and lamb. Lamb and beef are frequently used for grilling. Offal is a popular fast food in cities, and foie gras is a delicacy that has been prepared in the region since at least 2500 BCE. Fish and seafood are common in Egypt's coastal regions. A significant amount of Egyptian cuisine is vegetarian, due to both the historically high price of meat and the needs of the Coptic Christian community, whose religious restrictions require essentially vegan diets for much of the year.",
  "Filipino": "Filipino cuisine is composed of the cuisines of more than a hundred distinct ethnolinguistic groups found throughout the Philippine archipelago. A majority of mainstream Filipino dishes that compose Filipino cuisine are from the food traditions of various ethnolinguistic groups and tribes of the archipelago",
  "French": "In the 19th century, French cuisine underwent another transformation with the rise of the restaurant industry. French chefs opened restaurants that served high-quality food to a wider audience, and this helped to spread French culinary techniques and recipes throughout the world. Today, French cuisine remains one of the most respected and influential in the world, with its emphasis on fresh, high-quality ingredients, precise cooking techniques, and elegant presentation. French chefs continue to innovate and experiment with new flavors and ingredients, while also remaining committed to preserving the traditions and techniques of classic French cuisine.",
  "Greek": "The most characteristic and ancient element of Greek cuisine is olive oil, which is used in most dishes. It is produced from the olive trees prominent throughout the region, and adds to the distinctive taste of Greek food. The olives themselves are also widely eaten. The basic grain in Greece is wheat, though barley is also grown. Important vegetables include tomato, aubergine (eggplant), potato, green beans, okra, green peppers (capsicum), and onions. Honey in Greece is mainly honey from the nectar of fruit trees and citrus trees: lemon, orange, bigarade (bitter orange) trees, thyme honey, and pine honey. Mastic, an aromatic, ivory-coloured plant resin, is grown on the Aegean island of Chios.",
  "Indian": "Indian cuisine consists of a variety of regional and traditional cuisines native to India. Given the diversity in soil, climate, culture, ethnic groups, and occupations, these cuisines vary substantially and use locally available spices, herbs, vegetables, and fruits. Indian food is also heavily influenced by religion, in particular Hinduism and Islam, cultural choices and traditions.",
  "Irish": "Irish cuisine encompasses the cooking styles, traditions and recipes associated with the island of Ireland. It has evolved from centuries of social and political change and the mixing of different cultures, predominantly with those from nearby Britain and other European regions. The cuisine is founded upon the crops and animals farmed in its temperate climate and the abundance of fresh fish and seafood from the surrounding waters of the Atlantic Ocean. Chowder, for example, is popular around the coasts.",
  "Italian": "Italian cuisine is one of the most popular and influential in the world, known for its rich flavors, simple ingredients, and traditional cooking techniques. Its history dates back thousands of years and has been shaped by a variety of factors, including geography, climate, and cultural exchange. In the 19th and 20th centuries, Italian cuisine underwent a period of modernization, with the development of new techniques and ingredients, and the rise of regional specialties. Today, Italian cuisine is known for its diversity and versatility, with dishes that range from rustic and simple to elaborate and refined.",
  "Jamaican": "Jamaican cuisine includes a mixture of cooking techniques, flavours and spices influenced by Amerindian, African, Irish, English, French, Portuguese, Spanish, Indian, Chinese and Middle Eastern people who have inhabited the island. It is also influenced by the crops introduced into the island from tropical Southeast Asia, many of which are now grown locally. A wide variety of seafood, tropical fruits and meats are available. Some Jamaican dishes are variations on cuisines brought to the island from elsewhere. These are often modified to incorporate local produce and spices. Others are novel or fusion and have developed locally. Popular Jamaican dishes include curry goat, fried dumplings, ackee and saltfish. Jamaican patties along with various pastries, breads and beverages are also popular.",
  "Japanese": "Japanese cuisine is known for its emphasis on fresh ingredients, seasonality, and simple preparation methods. It is characterized by a focus on clean flavors, delicate presentation, and a balance of textures. Traditional Japanese dishes include sushi, sashimi, tempura, and soba noodles. Japanese cuisine also incorporates a variety of cooking techniques, such as grilling, steaming, and simmering, to bring out the natural flavors of ingredients.",
  "Mexican": "Mexican cuisine has a long and complex history that has been shaped by a variety of cultural, geographic, and historical factors. Before the arrival of the Spanish in the 16th century, the indigenous peoples of Mexico had developed a rich culinary tradition based on the cultivation of corn, beans, and other native crops. The Aztecs, for example, had a sophisticated culinary culture that included the use of chocolate and other complex flavors.",
  "Moroccan": "Moroccan cuisine is the cuisine of Morocco, fueled by interactions and exchanges with many cultures and nations over the centuries.Moroccan cuisine is usually a mix of Berber, Andalusi, Mediterranean, and Arab cuisines, with minimal European (French and Spanish) and sub-Saharan influences. Like the rest of the Maghrebi cuisine, Moroccan cuisine has more in common with Middle Eastern cuisine than with the rest of Africa. Morocco produces a large range of Mediterranean fruits and vegetables, as well as tropical products like snails. Common meats include beef, goat, mutton and lamb, which, together with chicken and seafood, serve as a base for the cuisine. Characteristic flavorings include lemon pickle, argan oil, preserved butter (smen), olive oil, and dried fruits.",
  "Portuguese": "Portuguese dishes include meats (pork, beef, poultry mainly also game and others), seafood (fish, crustaceans such as lobster, crab, shrimps, prawns, octopus, and molluscs such as scallops, clams and barnacles), vegetables and legumes and desserts (cakes being the most numerous). Portuguese often consume rice, potatoes, sprouts (known as grelos), and bread with their meals and there are numerous varieties of traditional fresh breads like broa which may also have regional and national variations within the countries under Lusophone or Galician influence. In a wider sense, Portuguese and Galician cuisine share many traditions and features.",
  "Russian": "The national Russian cuisine has evolved in a multicultural and multiethnic state, with strong mutual influence from the cuisines of other ethnic groups that live within the nation's borders or had been a part of the Russian state historically. Despite such deep mutual influence, many national cuisines within the borders of the Russian Federation maintain their uniqueness, such as Tatar cuisine, Sakha cuisine, or Yamal cuisine.",
  "Spanish": "Spanish cuisine is known for its rich flavors and diverse influences, reflecting the country's history and cultural heritage. From hearty paella dishes to delicious tapas and fresh seafood, there's something for everyone. Discover the unique flavors of Spain through our collection of authentic recipes and cooking tips.",
  "Thai": "Thai cuisine is the national cuisine of Thailand. Thai cooking places emphasis on lightly prepared dishes with strong aromatic components and a spicy edge. Australian chef David Thompson, an expert on Thai food, observes that unlike many other cuisines, Thai cooking is 'about the juggling of disparate elements to create a harmonious finish. Like a complex musical chord it's got to have a smooth surface but it doesn't matter what's happening underneath. Simplicity isn't the dictum here, at all.' Traditional Thai cuisine loosely falls into four categories: tom (boiled dishes), yam (spicy salads), tam (pounded foods), and kaeng (curries). Deep-frying, stir-frying and steaming are methods introduced from Chinese cuisine.",
  "Tunisian":"Tunisian cuisine, the cuisine of Tunisia, consists of the cooking traditions, ingredients, recipes and techniques developed in Tunisia since antiquity. It is mainly a blend of Mediterranean and native Punics-Berber cuisine. Historically, Tunisian cuisine influenced many cultures and nations like Italians, Andalusians, French and Arabs. Like many countries in the Mediterranean basin, the Tunisian cuisine is heavily based on olive oil, spices, tomatoes, seafood and meat. Yet, it has a distinctive spiciness that differs it from surrounding cuisines.",
  "Turkish": "Turkish cuisine is known for its rich flavors and diverse dishes, influenced by the country's history and geography. It features a blend of Central Asian, Middle Eastern, and Balkan cuisines, with a focus on fresh vegetables, herbs, and spices. Popular dishes include kebabs, baklava, and Turkish delight. Discover more about Turkish cuisine and its delicious recipes!",
  "Vietnamese":"Vietnamese cuisine is known for its bold flavors and fresh ingredients, with a focus on herbs, citrus, and chilies. Some popular dishes include pho, banh mi, and spring rolls."
}

